Repository: Slipfaith/tmragger
Catalog: sample-tmx/HW_Marketing_RU-EN_repaired_repaired_repaired.tmx
Source language: ru_ru
Languages: en_us

source: С этой рекламой точно что-то не так!
en_us: Something's definitely wrong with this ad!

source: Она действительно выглядит пугающе!
en_us: It’s actually scary!

source: Она привлекла мое внимание и я не могу оторваться от просмотра!
en_us: It attracted my attention, and I can’t look away!

source: Самое время пройти новый игровой уровень.
en_us: It’s time to complete a new game level.

source: Здесь все понятно, я вижу своих врагов и понимаю, как выиграть!
en_us: Got it, I see my enemies and know how to beat them!

source: Мне нравится быстрой рост и большое количество игровых персонажей на выбор и обличий для них.
en_us: I like fast-paced growth and the large number of playable characters and skins to choose from.

source: Кажется, я могу добиться успеха в этой игре!
en_us: I think I can do well in this game!

source: Становится все сложнее делать правильный выбор.
en_us: It’s going to get even harder to make the right choice.

source: Ставки растут!
en_us: The stakes are growing!

source: Скоро узнаем, смогу ли я целиком пройти этот уровень.
en_us: We’ll find out soon if I can fully complete this level.

source: Дерево волшебства
en_us: Magic Tree

source: Вырастите самое высокое гильдейское дерево!
en_us: Grow the tallest Guild Tree!

source: Конкурс гильдий на самое высокое дерево волшебства!
en_us: Take part in the guild contest to grow the tallest Magic Tree!

source: Получайте призы за каждую взятую высоту и обгоните других!
en_us: Get rewards for each milestone and take the lead!

source: Лови зимние скидки до 65% и вырасти самое высокое дерево волшебства!
en_us: Check the new winter deals with up to 65% off and grow the tallest Magic Tree!

source: Зима принесла в Доминион согревающие предложения!
en_us: Get warmed up with new winter deals in Dominion!

source: Не упусти шанс приобрести предметы в магазине и сундуки со скидкой до 65% и получи в 4 раза больше изумрудов при покупке!
en_us: Don’t miss the chance to buy shop items and chests with up to 65% off and get 4 times as many emeralds for your purchase!

source: А еще можно пополнить запасы ценных ресурсов, вырастив самое высокое гильдейское дерево: объедините усилия, получайте призы за каждую взятую высоту и обгоните другие гильдии!
en_us: Also you can stock up on valuable resources by growing the tallest Guild Tree! Work together, get rewards for each milestone and get ahead of your rivals!

source: Предновогоднее обновление!
en_us: Pre-New Year’s Update!

source: Волшебное дерево Праздники уже на носу, но куда вешать украшения?
en_us: Magic Tree Holidays are right around the corner, but where do we put the decorations?

source: Объедини силы с друзьями по гильдии и вырасти самую пышную елку в Доминионе!
en_us: Help your guildmates grow the most magnificent Festive Tree in Dominion!

source: За свой вклад в событие ты получишь ценные призы и уникальный облик для одного из героев!
en_us: Take part in the event to receive valuable prizes and a unique skin for one of your Heroes!

source: Зимнее приключение Не дай темным силам оставить жителей Доминиона без праздника!
en_us: Winter Adventure Don’t let dark forces ruin holidays for the residents of Dominion!

source: Отправляйся вместе с Чаббой и Фокс в захватывающее приключение, полное опасностей, зимних чудес и потрясающих подарков!
en_us: Go on a thrilling adventure with Chabba and Fox full of danger, winter miracles, and amazing gifts!

source: Создай атмосферу праздника!
en_us: Create a festive atmosphere!

source: Зимние облики
en_us: Winter Skins

source: Наряди Фолианта и Айзека в сказочные костюмы!
en_us: Dress Folio and Isaac in fabulous outfits!

source: Не пропусти трехдневное событие с нарядами для Айзека и Фолианта и дополнительно улучши облик Фолианта в магазине!
en_us: Don’t miss the 3-day event with outfits for Isaac and Folio, and upgrade Folio’s skin in the shop!

source: Не пропусти скидку 65% на новые сказочные костюмы для Айзека и Фолианта!
en_us: Don’t miss out on a 65% discount on fabulous new outfits for Isaac and Folio!

source: Праздники закончились, а сюрпризы еще нет — начинается трехдневная зимняя распродажа!
en_us: The holidays have ended, but the surprises haven't—a 3-day winter sale is just beginning!

source: Тебя ждет скидка 65% на наборы с новыми сказочными нарядами для Айзека и Фолианта.
en_us: Get a 65% discount on sets of fabulous new outfits for Isaac and Folio.

source: Кроме того, облик Фолианта можно дополнительно у
en_us: And what’s more, you can also upgrade Folio’s skin in the event shop.

source: лучшить в магазине события — пусть он сияет краше новогодней елки!
en_us: Let him shine brighter than a Christmas tree!

source: Герой месяца — Андвари
en_us: Hero of the Month — Andvari

source: Усиливай мастера стихии Земли весь январь!
en_us: Upgrade the master of Earth throughout January!

source: Играй каждый день, чтобы собирать камни душ для Андвари.
en_us: Play every day to collect Andvari’s Soul Stones.

source: Сделай искусного создателя Артефактов Титанов еще сильнее!
en_us: Make the ingenious creator of the Titan Artifacts even stronger!

source: Повышай мощь непревзойденного Андвари на протяжении всего января!
en_us: Increase the might of unrivaled Andvari throughout January!

source: Заходи в игру каждый день, чтобы собрать как можно больше камней душ для искусного создателя Артефактов Титанов и значительно усилить его мощь!
en_us: Log in every day to collect Soul Stones for the ingenious creator of the Titan Artifacts and greatly increase his power!

source: Удерживай врагов каменной хваткой и бейся со злом под благословением стихии Земли!
en_us: Blessed by the element of Earth, hold your enemies with a stone-like grasp and fight evil!

source: Сезон небесных огней
en_us: Celestial Lights Season

source: Целый фейерверк событий и сюрпризов!
en_us: Fireworks of events and surprises!

source: Тебя ждут щедрые праздничные дары!
en_us: Expect a plethora of festive gifts!

source: Не пропусти новые события, турнир титанов и восточные облики!
en_us: Don't miss out on new events, a titan tournament and Lunar Skins!

source: В сезоне небесных огней тебя ждет фейерверк красочных событий!
en_us: Celebrate with fireworks of unforgettable events in the Celestial Lights Season!

source: Присоединяйся к многодневному торжеству с приятными сюрпризами и захватывающими приключениями!
en_us: Join several days of festivities with nice surprises and exciting adventures!

source: Пополняй припасы, добывай призовых матрешек вместе с Альванором в событии Пути природы, бейся в турнире титанов и не упусти возможность улучшить талисманы и получить новые восточные облики для героев!
en_us: Get supplies, obtain prize dolls with Alvanor in the Way of Nature event, fight in the titan tournament, and don't miss out on an opportunity to upgrade talismans and get new Lunar Skins for heroes!

source: Чтоб у меня палочка отсохла, вы те, кто мне нужен!
en_us: My wand be damned! You're the ones I need!

source: в игре вышли обновления для наших любимых игроков
en_us: The game has updates for our favorite players

source: В новой башне невероятно много сокровищ, предметов и ЗОЛОТА!
en_us: The new tower is filled with treasure, valuable items and GOLD!

source: Надеюсь, вы привиты от золотой лихорадки!
en_us: Hope you're vaccinated against the gold fever!

source: Теперь тебе доступны уникальные реликвии после каждой схватки.
en_us: Now you can get powerful relics after each battle.

source: Собери все реликвии для мощной победы
en_us: Collect all relics for an overwhelming victory

source: пройди башню до конца и сразись с главным злодеем Hero Wars
en_us: Complete the tower and fight the main villain of Hero Wars

source: Магия востока!
en_us: Magic of the East!

source: Перерожденная Цин Мао
en_us: Qing Mao Reborn

source: У отважной воительницы новый внешний вид и способности, но ее связь с братом Цин Луном все так же крепка.
en_us: The brave warrior now has a new appearance and abilities, but her bond with her brother Qing Long is as strong as ever.

source: Помоги им побороть зло и защитить Доминион!
en_us: Help them defeat evil and protect Dominion!

source: Восточные облики
en_us: Lunar Skins

source: Наряди Цин Мао, Лиэн и Темпуса в восточные костюмы!
en_us: Dress Qing Mao, Lian, and Tempus in Lunar outfits!

source: А облик Цин Мао можно дополнительно улучшить в магазине события, чтобы ярость дракона разгорелась еще сильнее!
en_us: To make dragon's fury burn even brighter, upgrade Qing Mao's skin in the event shop!

source: Испепели своих врагов!
en_us: Burn your enemies to ashes!

source: Страхи и печали
en_us: Fears and Troubles

source: Освободи жрицу Алого города и вылечи коз Хоатта!
en_us: Free the Crimson Priestess and save Hoatt's goats!

source: Помоги Сироко впечатлить Лаури своей храбростью, а затем спаси козочек Хоатта от досадного недуга!
en_us: Help Siroko impress Lauri with his bravery and save Hoatt's goats from the unfortunate sickness!

source: Помоги Сироко и Лаури добраться до сокровищ Алого города и исцели коз Хоатта!
en_us: Help Siroko and Lauri find the Scarlet City treasure and save Hoatt's goats!

source: Архипелаг охватила хандра!
en_us: The archipelago has got the blues!

source: Сироко тоскует без приключений, а целое стадо коз Хоатта страдает от грустянки.
en_us: Siroko yearns for an adventure, and Hoatt's goats have been struck with melancholy.

source: Помоги юному герою совершить новый подвиг и освободить жрицу Алого города — Лаури точно оценит такой храбрый поступок.
en_us: Help the young hero accomplish a new feat and free the Crimson Priestess—Lauri will definitely appreciate such a courageous act.

source: А затем отправляйся в долину белоцветов, собери ингредиенты для лекарственного отвара и исцели несчастных козочек.
en_us: And then go to the Whitebloom Valley, gather ingredients for the medicinal decoction and save the poor goats.

source: Верни хорошее настроение всем обитателям островов!
en_us: Get the islands' inhabitants back in a good mood!

source: Полезные изменения!
en_us: Helpful updates!

source: Простая смена талисманов Поменять талисман героя теперь можно прямо перед боем!
en_us: Easily switch Talismans Now you can change your Hero's Talisman right before battle!

source: Подбирай подходящие варианты в окне выбора команд атаки и защиты!
en_us: Choose your best options in the attack and defense team selection window!

source: Удобный подбор отряда Мы улучшили экран выбора героев: теперь ты можешь в любой момент переключиться между отображением в виде плитки и в виде рулетки!
en_us: Convenient team selection We’ve improved the Hero selection screen: now you can switch between tile view and roulette view at any time!

source: Пусть ничто не отвлекает тебя от спасения Доминиона!
en_us: Let nothing distract you from saving Dominion!

source: На сцене новая героиня Пич!
en_us: The New Hero takes the stage!

source: Безумная артистка уже в игре!
en_us: The wild performer is here!

source: Фанатично преданная богам Хаоса Пич владеет кнутом с изящной жестокостью и превращает бой в зрелищный кошмар!
en_us: Peech is a follower of Chaos gods. She wields a whip with elegant cruelty and turns battles into spectacular nightmares!

source: Готовы к шоу?
en_us: Are you ready for the show?

source: Безумная артистка Пич уже в игре!
en_us: The wild performer Peech is here!

source: Фанатично преданная богам Хаоса Пич владеет кнутом с изящной жестокостью.
en_us: Being a fanatical follower of Chaos gods, Peech wields her whip with exquisite cruelty.

source: Она играючи ослабляет врагов, виртуозно усиливает союзников и превращает бой в зрелищный кошмар.
en_us: She weakens enemies with no effort, buffs allies masterfully, and turns battles into spectacular nightmares.

source: Но что скрыто за маской обаятельной артистки?
en_us: But what is hidden behind the mask of a charismatic performer?

source: Узнай в новом приключении, полном ярких сражений и незабываемых испытаний!
en_us: Find out in the new adventure full of exciting battles and unforgettable challenges!

source: Представление начинается!
en_us: The show is about to begin!

source: Сердца Доминиона
en_us: Hearts of Dominion

source: Новые романтические облики уже в Доминионе!
en_us: New romantic skins have arrived in the Dominion!

source: Не упусти шанс принарядить Корвуса и Морриган в романтические наряды, а также улучшить облик Морриган!
en_us: Don’t miss your chance to deck out Corvus and Morrigan in romantic outfits and upgrade Morrigan’s skin!

source: Новые романтические облики для Морриган и Корвуса уже в Доминионе!
en_us: New romantic skins for Morrigan and Corvus have arrived in the Dominion!

source: Любовь витает в воздухе... В честь праздника мы подготовили тематическую трехдневную распродажу.
en_us: Love is in the air... To celebrate the holiday, we've got a themed, three-day sale for you.

source: Тебя ждут новые романтические наряды для Корвуса и Морриган, в которых они с легкостью покорят любые сердца!
en_us: New romantic outfits for Corvus and Morrigan will help them steal any hearts!

source: А облик Морриган можно дополнительно улучшить, чтобы ее отражение магии стало вдвое сильнее.
en_us: Morrigan's skin can also be upgraded to make her magic reflection twice as strong.

source: Не упусти выгодные предложения!
en_us: Don’t miss out on this great offer!

source: Шесть новых могущественных Талисманов совсем скоро появятся в Доминионе!
en_us: Six powerful new Talismans will soon arrive in Dominion!

source: Не пропусти это важное обновление, ведь они будут усилены уникальными характеристиками.
en_us: Don't miss this important update — they come with unique stats.

source: Узнаем о них подробнее!
en_us: Let's take a closer look!

source: Стойкость: Снижает весь входящий от врагов урон, если у Героя осталось мало здоровья.
en_us: Resilience: Reduces all incoming damage from enemies when Hero's health is low.

source: Действует на все типы урона (физический, магический и чистый), кроме потери здоровья от дружественных способностей.
en_us: Applies to all damage types (physical, magical, and pure) except health loss from allied abilities.

source: Работает по формуле, которая определяет, на какой % снизится входящий урон: Стойкость / (Стойкость + главная характеристика врага) × 100%‍♂️Шанс магического критического удара: Герой получает шанс нанести увеличенный магический урон.
en_us: A formula determines the percentage of damage reduction: Resilience / (Resilience + enemy’s main stat) × 100%‍♂️️Magical Critical Hit Chance: Grants the Hero a chance to deal increased magic damage.

source: Срабатывает только при нанесении магического урона.
en_us: Activates only when dealing magic damage.

source: Работает также, как и обычный Шанс критического удара, по формуле: ШМК / (ШМК + главная характеристика врага) × 100%.
en_us: Works just like the regular Critical Hit Chance, following the formula: MCHC / (MCHC + enemy’s main stat) × 100%.

source: Говорят, хороший герой никогда не опаздывает.
en_us: They say a good hero is never late.

source: Но твой противник...ну скажем так, он не приходит рано!
en_us: But your opponent... Well, let’s just say he won’t be early!

source: Зрелищное обновление!
en_us: Spectacular update!

source: Новая героиня В зловещем свете софитов на сцене Доминиона появляется новая звезда — бесподобная Пич!
en_us: New heroine Under the sinister lights of the Dominion’s stage, a new star appears: the incomparable Peech!

source: Легким взмахом кнута она привносит в бой хаос, заставляя врагов трепетать перед ее талантом.
en_us: With a simple crack of her whip, she brings chaos to the battle, causing enemies to tremble before her.

source: Добавь Пич в свою команду и устрой незабываемое шоу!
en_us: Add Peech to your team and put on an unforgettable show!

source: Романтические облики Не пропусти очаровательные наряды для Корвуса, Морриган и Пич!
en_us: Romantic skins Don't miss out on charming outfits for Corvus, Morrigan, and Peech!

source: А облик Морриган можно дополнительно улучшить, чтобы она отражала магию еще эффективнее и эффектнее!
en_us: Morrigan's skin can also be upgraded to make her magic reflection even more efficient and dramatic!

source: Настало твое время сиять!
en_us: It’s your time to shine!

source: Временная аномалия
en_us: Temporal Anomaly

source: Улучши Темпуса и пополни запас полезных ресурсов!
en_us: Upgrade Tempus and stock up on useful resources!

source: Выполняй задания, чтобы призвать Темпуса, а также приобрести камни душ для него и другие ресурсы.
en_us: Complete tasks to summon Tempus, and buy Soul Stones and other resources for him.

source: Время ограничено!
en_us: Time is limited!

source: Улучши Темпуса и пополни запас полезных ресурсов с выгодой до 65%!
en_us: Upgrade Tempus and stock up on useful resources at a 65% discount!

source: Выполняй задания, чтобы добавить в свою команду Темпуса, а также приобрести камни душ для него и другие ценные ресурсы в магазине события!
en_us: Complete tasks to add Tempus to your team, and buy Soul Stones and other valuable resources for him in the event shop!

source: Тебя ждут аномальные скидки до 55% на сундуки и до 65% на товары в карусели, а также в четыре раза больше изумрудов за обычную цену!
en_us: Anomalous discounts up to 55% on chests and up to 65% on carousel items await, as well as four times as many emeralds for the same price!

source: Время ограничено — не теряй ни секунды!
en_us: Time is limited—don‘t waste a second!

source: Лови дары Святого Патрика!
en_us: Grab Saint Patrick's Gifts!

source: Заходи в игру каждый день и забирай подарки!
en_us: Log in daily and get rewards!

source: А с 20 марта начинается "Древо Волшебства". Помогай своей гильдии вырастить самое высокое дерево и соревнуйся за призы!
en_us: The Magic Tree starts on March 20 — team up with your guild to grow the tallest tree and compete for prizes!

source: Заходи каждый день за подарками от Лепрекотиков и выращивай Древо Волшебства!
en_us: Log in daily for gifts from Leprecats and grow the Magic Tree!

source: Лови удачу за хвост!
en_us: Grab your luck by the tail!

source: Лепрекотики уже ждут — заходи в игру каждый день и получай ценные награды в Адвент-календаре!
en_us: The Leprecats are waiting — log in every day to collect valuable rewards in the Advent Calendar!

source: А с 20 марта расцветает Древо Волшебства — помогай своей гильдии взрастить его и сражайся за место в рейтинге.
en_us: The Magic Tree will start to bloom on March 20 — help your guild grow it and compete for a place in the ranking.

source: Чем выше ваше древо, тем круче призы!
en_us: The tallest trees bring the coolest rewards!

source: Ивенты доступны с 11 уровня команды.
en_us: Events are available from Team Level 11.

source: Присоединяйся к приключению и забирай свои награды!
en_us: Join the adventure and claim your rewards!

source: Стань лидером, который вернёт Доминиону былую славу!
en_us: Become the leader and restore the Dominion to its former glory!

source: Архидемон победил.
en_us: The Archdemon won.

source: Стражи пали, а многие из них обращены в тёмных воинов.
en_us: The Guardians have fallen, and many of them have turned into warriors of darkness.

source: Но надежда жива — Аврора вырвалась из его власти, и теперь твоя очередь вернуть остальных!
en_us: But hope still lives — Aurora broke free of his power. Now it's your turn to bring back the others!

source: Hero Wars Alliance — не просто RPG, а испытание стратегии, тактики и решимости.
en_us: Hero Wars: Alliance is not just an RPG. It's a test of strategy, tactics, and resolve.

source: Собери команду героев, развивай их способности, предугадывай ходы врагов и веди свою армию к победе!
en_us: Gather a team of Heroes, upgrade their skills, predict enemy moves, and lead your army to victory!

source: СОЗДАВАЙ НЕПОБЕДИМЫЕ КОМБИНАЦИИ ГЕРОЕВ
en_us: FIND THE STRONGEST HERO COMBINATIONS

source: Хаос, Вечность, Честь, Тайна, Природа и Прогресс.
en_us: Chaos, Eternity, Honor, Mystery, Nature, and Progress.

source: Каждая фракция обладает своими особенностями и стилем ведения боя.
en_us: Each faction has its own characteristics and gameplay style.

source: Изучи способности героев, находи неожиданные комбинации и используй слабости противников, чтобы изменить ход сражения!
en_us: Learn Hero skills, find unexpected combinations, and exploit enemy weaknesses to turn the tide of battle!

source: Собери сбалансированную команду, продумывай тактику и раскрывай потенциал своих воинов, чтобы одерживать победу в PvE-испытаниях и PvP-сражениях.
en_us: Gather a balanced team, think your tactics through, and unlock the potential of your warriors to win in PvE challenges and PvP battles.

source: Играй за хитроумного инженера, могущественного мага или любого другого из шести фракций!
en_us: Play as a cunning engineer, a powerful mage or any other character from the six factions!

source: Обыгрывай соперников в PvP
en_us: Dominate in PvP

source: Вступай в PvP дуэли на Арене, обыгрывай соперников и поднимайся на вершину рейтинга!
en_us: Fight in PvP duels in the Arena, dominate over your rivals, and get to the top of the ranking!

source: Брось вызов героям со всего мира, и докажи, что именно твоя команда достойна славы.
en_us: Challenge Heroes from all over the world and prove that it's your team that deserves glory.

source: Соревнуйся в Драфте Легенд
en_us: Compete in Legends Draft

source: Выбери команду из случайных, но полностью прокачанных героев для победы в этом PvP-режиме.
en_us: Pick a team of random but fully leveled Heroes to win in this PvP mode.

source: Побеждает тот, чья команда одержит верх быстрее.
en_us: The player whose team is the first to gain the upper hand wins.

source: Пройди все уровни PvE-испытаний
en_us: Complete all levels of PvE challenges

source: Сражайся с могущественными боссами в Башне, которая состоит из нескольких уровней.
en_us: Face powerful bosses in the Tower that has multiple levels.

source: После каждой схватки тебе предстоит выбрать нужный бафф, без которого не выиграть следующую!
en_us: After each fight, you need to pick a buff that'll help you win the next!

source: Доберись до вершины Башни и получи множество ценного лута!
en_us: Reach the top of the Tower and get a lot of valuable loot!

source: Вступай в Гильдию
en_us: Join a Guild

source: Создай свою Гильдию или присоединяйся к существующей!
en_us: Create your own Guild or join an existing one!

source: Участвуй в Войнах Гильдий, чтобы попасть в высшую лигу и принять участие в Столкновении Миров.
en_us: Take part in Guild Wars to get to the top league and fight in the Clash of Worlds.

source: Исследуй мир Доминиона в Адвенчуре
en_us: Explore the world of the Dominion in Adventures

source: Адвенчуры -это временные события с увлекательным сюжетом и эпичными битвами.
en_us: Adventures are limited-time events with a gripping story and epic battles.

source: Отправляйся в приключения по Доминиону, выполняй квесты, убивай боссов и получай уникальные награды!
en_us: Embark on Adventures in the Dominion, complete quests, kill bosses, and get unique rewards!

source: Сражайся в Битвах Титанов
en_us: Take part in Titan Battles

source: Титаны — мощные существа, владеющие силами стихий.
en_us: Titans are formidable creatures wielding the power of elements.

source: Собирай Огненных, Водных, Земных, Воздушных и Титанов Тьмы, чтобы сражаться в Битвах Титанов и побеждать в Войнах Гильдий!
en_us: Gather Fire, Water, Earth, Air, and Dark Titans, take part in Titan Battles, and win Guild Wars!

source: Готов к битве?
en_us: Are you ready for battle?

source: Выбирай воинов, предугадывай ходы соперников и веди свою команду к славе!
en_us: Pick warriors, predict enemy moves, and lead your team to victory!

source: Луговая Монета
en_us: Meadow Coin
